        IDENTIFICATION DIVISION.                                        00010001
        PROGRAM-ID. HELLO.                                              00020001
        PROCEDURE DIVISION.                                             00030001
            DISPLAY "HELLO WORLD".                                      00040002
            STOP RUN.                                                   00050001
