EDIT       ADCDC.COB.SRC(HELLO) - 01.02                    Columns 00001 00072 
Command ===>                                                  Scroll ===> PAGE 
****** ***************************** Top of Data ******************************
000100         IDENTIFICATION DIVISION.                                        
000200         PROGRAM-ID. HELLO.                                              
000300         PROCEDURE DIVISION.                                             
000400             DISPLAY "HELLO WORLD".                                      
000500             STOP RUN.                                                   
