//ADCDEC   JOB (ACCT#),'HELLO',MSGCLASS=H,REGION=4M,
//    CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID,
//    COND=(4,LT)
//*
//* ETAPE DE COMPILATION DU PROGRAMME COBOL
//*
//STEP1  EXEC PCOMCOB2,
//        MBR=INDEXREC,
//        SRC=ADCDE.COB.SRC,
//        LMOD=ADCDE.COB.LOAD
//COB.SYSLIB DD DSN=ADCDE.COB.CPY,DISP=SHR
/*
