//ADCDCC   JOB (ACCT#),'HELLO',MSGCLASS=H,REGION=4M,
//    CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID,
//    COND=(4,LT)
//*
//* ETAPE DE COMPILATION DU PROGRAMME COBOL
//*
//STEP1  EXEC PCOMCOB2,
//        MBR=BAPP1,
//        SRC=ADCDC.COB.SRC,
//        LMOD=ADCDC.COB.LOAD
//COB.SYSLIB DD DSN=ADCDC.COB.CPY,DISP=SHR
/*
